# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd
from scipy import stats

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [21]:
orders = pd.read_csv('Orders.csv')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
group_id = orders.groupby(['CustomerID']).agg({'amount_spent':'sum'})
group_id

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40
...                  ...
18280             180.60
18281              80.82
18282             178.05
18283            2094.88
18287            1837.28

[4339 rows x 1 columns]

In [4]:
group_id["amount_spent"].quantile(0.95)

5840.181999999982

In [5]:
group_id["amount_spent"].quantile(0.75)

1661.64

In [6]:
VIP_costumers = group_id[group_id['amount_spent']> 5840.181999999982]
VIP_costumers

            amount_spent
CustomerID
12346           77183.60
12357            6207.67
12359            6372.58
12409           11072.67
12415          124914.53
...                  ...
18109            8052.97
18139            8438.34
18172            7561.68
18223            6484.54
18229            7276.90

[217 rows x 1 columns]

In [7]:
group_id[(group_id['amount_spent']< 5840.181999999982) & (group_id['amount_spent']> 1661.64 )]

            amount_spent
CustomerID
12347            4310.00
12348            1797.24
12349            1757.55
12352            2506.04
12356            2811.43
...                  ...
18259            2338.60
18260            2643.20
18272            3078.58
18283            2094.88
18287            1837.28

[868 rows x 1 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [10]:
group_id1 = orders.groupby(['CustomerID']).first()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,Country,amount_spent
CustomerID,,,,,,,,,,,,,
12346,61619,541431,23166,2011,1,2,10,medium ceramic top storage jar,74215,2011-01-18 10:01:00,1.04,United Kingdom,77183.60
12347,14938,537626,85116,2010,12,2,14,black candelabra t-light holder,12,2010-12-07 14:57:00,2.10,Iceland,25.20
12348,34083,539318,84992,2010,12,4,19,72 sweetheart fairy cake cases,72,2010-12-16 19:09:00,0.55,Finland,39.60
12349,485502,577609,23112,2011,11,1,9,parisienne curio cabinet,2,2011-11-21 09:51:00,7.50,Italy,15.00
12350,80323,543037,21908,2011,2,3,16,chocolate this way metal sign,12,2011-02-02 16:01:00,2.10,Norway,25.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18280,111045,545712,82484,2011,3,1,9,wood black board ant white finish,3,2011-03-07 09:52:00,7.90,United Kingdom,23.70
18281,222954,556464,22037,2011,6,7,10,robot birthday card,12,2011-06-12 10:53:00,0.42,United Kingdom,5.04
18282,291854,562525,21270,2011,8,5,13,antique cream cutlery cupboard,1,2011-08-05 13:35:00,12.75,United Kingdom,12.75
18283,46026,540350,22356,2011,1,4,14,charlotte bag pink polkadot,1,2011-01-06 14:14:00,0.85,United Kingdom,0.85
18287,198716,554065,22755,2011,5,7,10,small purple babushka notebook,12,2011-05-22 10:39:00,0.85,United Kingdom,10.20

In [16]:
group_co = group_id1[['Country']]
group_co

                   Country
CustomerID
12346       United Kingdom
12347              Iceland
12348              Finland
12349                Italy
12350               Norway
...                    ...
18280       United Kingdom
18281       United Kingdom
18282       United Kingdom
18283       United Kingdom
18287       United Kingdom

[4339 rows x 1 columns]

In [18]:
group_id_co = pd.merge(group_id,group_co, on='CustomerID')
group_id_co

            amount_spent         Country
CustomerID
12346           77183.60  United Kingdom
12347            4310.00         Iceland
12348            1797.24         Finland
12349            1757.55           Italy
12350             334.40          Norway
...                  ...             ...
18280             180.60  United Kingdom
18281              80.82  United Kingdom
18282             178.05  United Kingdom
18283            2094.88  United Kingdom
18287            1837.28  United Kingdom

[4339 rows x 2 columns]

In [20]:
VIP_costumers_co = group_id_co[group_id_co['amount_spent']> 5840.181999999982]
VIP_costumers_co['Country'].value_counts()

United Kingdom     177
Germany             10
France               9
Switzerland          3
Australia            2
Spain                2
Japan                2
Portugal             2
EIRE                 2
Finland              1
Norway               1
Denmark              1
Cyprus               1
Singapore            1
Netherlands          1
Channel Islands      1
Sweden               1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [23]:
Combined_cost = group_id_co[group_id_co['amount_spent']> 1661.64 ]
Combined_cost['Country'].value_counts()

United Kingdom     932
Germany             39
France              29
Belgium             11
Switzerland          9
Spain                7
Portugal             7
Norway               7
Italy                5
Finland              5
Channel Islands      4
Australia            4
Japan                4
Cyprus               3
Denmark              3
EIRE                 3
Israel               2
Sweden               2
Singapore            1
Lebanon              1
Poland               1
Iceland              1
Greece               1
Netherlands          1
Austria              1
Canada               1
Malta                1
Name: Country, dtype: int64